mdhardenburgh/Cypress_PDL_2.1.0/devices/fm4/s6e2d5xg/s6e2d5xg.svd
        <!-- REGISTER "PZRA" -->
        <register>
          <name>PZRA</name>
          <description>Port Pseudo Open Drain Setting Register A [BHW]</description>
          <addressOffset>0x728</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000000</resetMask>
        </register>
        <!-- REGISTER "PZRB" -->
        <register>
          <name>PZRB</name>
          <description>Port Pseudo Open Drain Setting Register B [BHW]</description>
          <addressOffset>0x72C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000000</resetMask>
        </register>
        <!-- REGISTER "PZRC" -->
        <register>
          <name>PZRC</name>
          <description>Port Pseudo Open Drain Setting Register C [BHW]</description>
          <addressOffset>0x730</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000000</resetMask>
        </register>
        <!-- REGISTER "PZRD" -->
        <register>
          <name>PZRD</name>
          <description>Port Pseudo Open Drain Setting Register D [BHW]</description>
          <addressOffset>0x734</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000000</resetMask>
        </register>
        <!-- REGISTER "PZRE" -->
        <register>
          <name>PZRE</name>
          <description>Port Pseudo Open Drain Setting Register E [BHW]</description>
          <addressOffset>0x738</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000000D</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "P3" -->
            <field>
              <name>P3</name>
              <description>Bit3 of PZRE</description>
              <msb>3</msb>
              <lsb>3</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P2" -->
            <field>
              <name>P2</name>
              <description>Bit2 of PZRE</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P0" -->
            <field>
              <name>P0</name>
              <description>Bit0 of PZRE</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "PZRF" -->
        <register>
          <name>PZRF</name>
          <description>Port Pseudo Open Drain Setting Register F [BHW]</description>
          <addressOffset>0x73C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000000</resetMask>
        </register>
      </registers>
    </peripheral>
    <!-- PERIPHERAL "CANFD0" -->
    <peripheral>
      <name>CANFD0</name>
      <description>CAN FD Registers</description>
      <version>A</version>
      <groupName>CANFD</groupName>
      <baseAddress>0x40070000</baseAddress>
      <!-- ADDRESS BLOCK -->
      <addressBlock>
        <offset>0x0</offset>
        <size>0x8</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0xC</offset>
        <size>0x24</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x40</offset>
        <size>0x8</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x50</offset>
        <size>0x10</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x80</offset>
        <size>0xC</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x90</offset>
        <size>0x58</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0xF0</offset>
        <size>0xC</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x200</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x205</offset>
        <size>0x3</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x210</offset>
        <size>0xC</size>
        <usage>registers</usage>
      </addressBlock>
      <!-- INTERRUPT "CANFD0" -->
      <interrupt>
        <name>CANFD0</name>
        <value>81</value>
      </interrupt>
      <!-- REGISTERS -->
      <registers>
        <!-- REGISTER "CREL" -->
        <register>
          <name>CREL</name>
          <description>Core Release Register [BHW]</description>
          <addressOffset>0x00</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x30130506</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "REL" -->
            <field>
              <name>REL</name>
              <description>Core Release</description>
              <msb>31</msb>
              <lsb>28</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "STEP" -->
            <field>
              <name>STEP</name>
              <description>Step of Core Release</description>
              <msb>27</msb>
              <lsb>24</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "SUBSTEP" -->
            <field>
              <name>SUBSTEP</name>
              <description>Sub-step of Core Release</description>
              <msb>23</msb>
              <lsb>20</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "YEAR" -->
            <field>
              <name>YEAR</name>
              <description>Time Stamp Year</description>
              <msb>19</msb>
              <lsb>16</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "MON" -->
            <field>
              <name>MON</name>
              <description>Time Stamp Month</description>
              <msb>15</msb>
              <lsb>8</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "DAY" -->
            <field>
              <name>DAY</name>
              <description>Time Stamp Day</description>
              <msb>7</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "ENDN" -->
        <register>
          <name>ENDN</name>
          <description>Endian Register [BHW]</description>
          <addressOffset>0x04</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x87654321</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "ETV" -->
            <field>
              <name>ETV</name>
              <description>Endianness Test Value</description>
              <msb>31</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "FBTP" -->
        <register>
          <name>FBTP</name>
          <description>Fast Bit Timing and Prescaler Register [BHW]</description>
          <addressOffset>0x0C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x1F9F0F73</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "TDCO" -->
            <field>
              <name>TDCO</name>
              <description>Transceiver Delay Compensation Offset</description>
              <msb>28</msb>
              <lsb>24</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TDC" -->
            <field>
              <name>TDC</name>
              <description>Transceiver Delay Compensation</description>
              <msb>23</msb>
              <lsb>23</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "FBRP" -->
            <field>
              <name>FBRP</name>
              <description>Fast Baud Rate Prescaler</description>
              <msb>20</msb>
              <lsb>16</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "FTSEG1" -->
            <field>
              <name>FTSEG1</name>
              <description>Fast time segment before sample point</description>
              <msb>11</msb>
              <lsb>8</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "FTSEG2" -->
            <field>
              <name>FTSEG2</name>
              <description>Fast time segment after sample point</description>
              <msb>6</msb>
              <lsb>4</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "FSJW" -->
            <field>
              <name>FSJW</name>
              <description>Fast (Re) Synchronization Jump Width</description>
              <msb>1</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "TEST" -->
        <register>
          <name>TEST</name>
          <description>Test Register [BHW]</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00003FF0</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "TDCV" -->
            <field>
              <name>TDCV</name>
              <description>Transceiver Delay Compensation Value</description>
              <msb>13</msb>
              <lsb>8</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "RX" -->
            <field>
              <name>RX</name>
              <description>Receive Pin</description>
              <msb>7</msb>
              <lsb>7</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TX" -->
            <field>
              <name>TX</name>
              <description>Control of Transmit Pin</description>
              <msb>6</msb>
              <lsb>5</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "LBCK" -->
            <field>
              <name>LBCK</name>
              <description>Loop Back Mode</description>
              <msb>4</msb>
              <lsb>4</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "RWD" -->
        <register>
          <name>RWD</name>
          <description>RAM Watchdog [BHW]</description>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000FFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "WDV" -->
            <field>
              <name>WDV</name>
              <description>Watchdog Value</description>
              <msb>15</msb>
              <lsb>8</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "WDC" -->
            <field>
              <name>WDC</name>
              <description>Watchdog Configuration</description>
              <msb>7</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "CCCR" -->
        <register>
          <name>CCCR</name>
          <description>CC Control Register [BHW]</description>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000001</resetValue>
          <resetMask>0x00007FFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "TXP" -->
            <field>
              <name>TXP</name>
              <description>Transmit Pause</description>
              <msb>14</msb>
              <lsb>14</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "FDBS" -->
            <field>
              <name>FDBS</name>
              <description>CAN FD Bit Rate Switching</description>
              <msb>13</msb>
              <lsb>13</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "FDO" -->
            <field>
              <name>FDO</name>
              <description>CAN FD Operation</description>
              <msb>12</msb>
              <lsb>12</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "CMR" -->
            <field>
              <name>CMR</name>
              <description>CAN Mode Request</description>
              <msb>11</msb>
              <lsb>10</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CME" -->
            <field>
              <name>CME</name>
              <description>CAN Mode Enable</description>
              <msb>9</msb>
              <lsb>8</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TEST" -->
            <field>
              <name>TEST</name>
              <description>Test Mode Enable</description>
              <msb>7</msb>
              <lsb>7</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "DAR" -->
            <field>
              <name>DAR</name>
              <description>Disable Automatic Retransmission</description>
              <msb>6</msb>
              <lsb>6</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "MON" -->
            <field>
              <name>MON</name>
              <description>Bus Monitoring Mode</description>
              <msb>5</msb>
              <lsb>5</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CSR" -->
            <field>
              <name>CSR</name>
              <description>Clock Stop Request</description>
              <msb>4</msb>
              <lsb>4</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CSA" -->
            <field>
              <name>CSA</name>
              <description>Clock Stop Acknowledge</description>
              <msb>3</msb>
              <lsb>3</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "ASM" -->
            <field>
              <name>ASM</name>
              <description>Restricted Operation Mode</description>
              <msb>2</msb>
              <lsb>2</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CCE" -->
            <field>
              <name>CCE</name>
              <description>Configuration Change Enable</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "INIT" -->
            <field>
              <name>INIT</name>
              <description>Initialization</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "BTP" -->
        <register>
          <name>BTP</name>
          <description>Bit Timing and Prescaler Register [BHW]</description>
          <addressOffset>0x1C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000A33</resetValue>
          <resetMask>0x03FF3FFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "BRP" -->
            <field>
              <name>BRP</name>
              <description>Baud Rate Prescaler</description>
              <msb>25</msb>
              <lsb>16</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TSEG1" -->
            <field>
              <name>TSEG1</name>
              <description>Time segment before sample point</description>
              <msb>13</msb>
              <lsb>8</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TSEG2" -->
            <field>
              <name>TSEG2</name>
              <description>Time segment after sample point</description>
              <msb>7</msb>
              <lsb>4</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SJW" -->
            <field>
              <name>SJW</name>
              <description>(Re) Synchronization Jump Width</description>
              <msb>3</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "TSCC" -->
        <register>
          <name>TSCC</name>
          <description>Timestamp Counter Configuration [BHW]</description>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000F0003</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "TCP" -->
            <field>
              <name>TCP</name>
              <description>Timestamp Counter Prescaler</description>
              <msb>19</msb>
              <lsb>16</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TSS" -->
            <field>
              <name>TSS</name>
              <description>Timestamp Select</description>
              <msb>1</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "TSCV" -->
        <register>
          <name>TSCV</name>
          <description>Timestamp Counter Value [BHW]</description>
          <addressOffset>0x24</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000FFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "TSC" -->
            <field>
              <name>TSC</name>
              <description>Timestamp Counter</description>
              <msb>15</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "TOCC" -->
        <register>
          <name>TOCC</name>
          <description>Timeout Counter Configuration [BHW]</description>
          <addressOffset>0x28</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xFFFF0000</resetValue>
          <resetMask>0xFFFF0007</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "TOP" -->
            <field>
              <name>TOP</name>
              <description>Timeout Period</description>
              <msb>31</msb>
              <lsb>16</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TOS" -->
            <field>
              <name>TOS</name>
              <description>Timeout Select</description>
              <msb>2</msb>
              <lsb>1</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ETOC" -->
            <field>
              <name>ETOC</name>
              <description>Enable Timeout Counter</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "TOCV" -->
        <register>
          <name>TOCV</name>
          <description>Timeout Counter Value [BHW]</description>
          <addressOffset>0x2C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0000FFFF</resetValue>
          <resetMask>0x0000FFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "TOC" -->
            <field>
              <name>TOC</name>
              <description>Timeout Counter</description>
              <msb>15</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
