mdhardenburgh/Cypress_PDL_2.1.0/devices/fm4/s6e2d5xg/s6e2d5xg.svd
      </registers>
    </peripheral>
    <!-- PERIPHERAL "GDCSUB" -->
    <peripheral>
      <name>GDCSUB</name>
      <description>GDC Subsystem control registers</description>
      <version>A</version>
      <groupName>GDCSUB</groupName>
      <baseAddress>0xD0A00000</baseAddress>
      <!-- ADDRESS BLOCK -->
      <addressBlock>
        <offset>0x0</offset>
        <size>0x8</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0xC</offset>
        <size>0x8</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x18</offset>
        <size>0x20</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x40</offset>
        <size>0x14</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x58</offset>
        <size>0xC</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x78</offset>
        <size>0x18</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x100</offset>
        <size>0xC</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x13C</offset>
        <size>0x8</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x148</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <!-- REGISTERS -->
      <registers>
        <!-- REGISTER "LOCKUNLOCK" -->
        <register>
          <name>LOCKUNLOCK</name>
          <description>Lock Protection Setting register [W]</description>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "LOCKUNLOCK" -->
            <field>
              <name>LOCKUNLOCK</name>
              <description>Protection key of this address block setting bits</description>
              <msb>31</msb>
              <lsb>0</lsb>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "LOCKSTATUS" -->
        <register>
          <name>LOCKSTATUS</name>
          <description>Lock Protection Status register [W]</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000111</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "FREEZSTATUS" -->
            <field>
              <name>FREEZSTATUS</name>
              <description>Current status of freeze status</description>
              <msb>8</msb>
              <lsb>8</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "PRIVILEGESTATUS" -->
            <field>
              <name>PRIVILEGESTATUS</name>
              <description>Current status of privilege protection</description>
              <msb>4</msb>
              <lsb>4</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "LOCKSTATUS" -->
            <field>
              <name>LOCKSTATUS</name>
              <description>Current status of lock protection</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "CONFIGCLOCKCONTROL" -->
        <register>
          <name>CONFIGCLOCKCONTROL</name>
          <description>CONFIG Clock control register [W]</description>
          <addressOffset>0xC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000001</resetValue>
          <resetMask>0x00000007</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "CONFIGCLOCKSELECT" -->
            <field>
              <name>CONFIGCLOCKSELECT</name>
              <description>CONFIG Clock division ratio setting bits</description>
              <msb>2</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "VRAMINTERRUPTENABLE" -->
        <register>
          <name>VRAMINTERRUPTENABLE</name>
          <description>VRAM ECC error interrupt enable/disable register [W]</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000003</resetValue>
          <resetMask>0x00000003</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "VRAMINTERRUPTENABLESEC1" -->
            <field>
              <name>VRAMINTERRUPTENABLESEC1</name>
              <description>Interrupt control of VRAM ECC error for VRAM port1</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-write</access>
            </field>
            <!-- FIELD "VRAMINTERRUPTENABLESEC0" -->
            <field>
              <name>VRAMINTERRUPTENABLESEC0</name>
              <description>Interrupt control of VRAM ECC error for VRAM port0</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "VRAMINTERRUPTCLEAR" -->
        <register>
          <name>VRAMINTERRUPTCLEAR</name>
          <description>VRAM ECC error interrupt clear register [W]</description>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000003</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "VRAMINTERRUPTCLEARSEC1" -->
            <field>
              <name>VRAMINTERRUPTCLEARSEC1</name>
              <description>Clear interrupt of VRAM ECC error for VRAM port1</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>write-only</access>
            </field>
            <!-- FIELD "VRAMINTERRUPTCLEARSEC0" -->
            <field>
              <name>VRAMINTERRUPTCLEARSEC0</name>
              <description>Clear interrupt of VRAM ECC error for VRAM port0</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "VRAMINTERRUPTSTATUS" -->
        <register>
          <name>VRAMINTERRUPTSTATUS</name>
          <description>VRAM ECC error interrupt status register [W]</description>
          <addressOffset>0x1C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000003</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "VRAMINTERRUPTSTATUSSEC1" -->
            <field>
              <name>VRAMINTERRUPTSTATUSSEC1</name>
              <description>Indicator of VRAM Interrupt status for VRAM port1</description>
              <msb>1</msb>
              <lsb>1</lsb>
              <access>read-only</access>
            </field>
            <!-- FIELD "VRAMINTERRUPTSTATUSSEC0" -->
            <field>
              <name>VRAMINTERRUPTSTATUSSEC0</name>
              <description>Indicator of VRAM Interrupt status for VRAM port0</description>
              <msb>0</msb>
              <lsb>0</lsb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
